function y0 = newton(X,Y,x0)
	% X - вектор "х" координат интерполяционных точек
	% Y - вектор "у" координат интерполяционных точек
    % x0 - массив значений аргумента, для которых надо вычислить значения полинома
    % y0 - массив значений полинома Ньютона в точках x0
	
    %вычисление конечных разностей
    f = zeros(length(X)-1);
	for i = 1:(length(X)-1)
    	for j = 1:(length(X)-i)
        	if i == 1
            	f(i, j) = (Y(j+1)-Y(j))/(X(j+1)-X(j));
        	else
            	f(i, j) = (f(i-1, j+1)-f(i-1, j))/(X(j+i)-X(j));
        	end
    	end
    end
    
	%метод ньютона для вычисления значений в данных точках x0
	y0=ones(size(x0)).*Y(1);
	for i = 1:length(X)-1
    	tmp = ones(size(x0)).*f(i, 1);
        %(x-x_1)*..*(x-x_n)
    	for j = 1:i
        	tmp = tmp .* (x0 - X(j));
    	end
    	y0=y0+tmp;
	end
end
