% 40 точек для аппроксимации
x = [10.1; 10.2; 10.3; 10.8; 10.9; 11; 11; 11.4; 12.2; 13.3; 13.8; 14; 14; 14.5; 15; 15.6; 15.8; 17; 18.2; 19;
     19.1; 19.1; 19.6; 20; 20.1; 20.2; 20.8; 20.8; 21.5; 22.1; 22.3; 22.6; 23; 23.2; 22.7; 22.8; 23; 23.2; 23.5; 23.6];
y = [93; 97; 96; 87; 90; 84; 87; 87; 79; 84; 75; 76; 80; 69; 75; 64; 67; 59; 62; 50;
     52; 50; 54; 55; 56; 51; 62; 65; 57; 77; 74; 69; 83; 82; 76; 77; 86; 80; 91; 96];

X = x(1):0.1:x(end);
Y1 = polyval(polynom(x, y, 1), X);
Y2 = polyval(polynom(x, y, 2), X);
Y3 = polyval(polynom(x, y, 3), X);
f = func(x, y);
Y4 = f(1)*exp(X) + f(2)*log(X) + f(3);

plot(x,y,'*');
hold on;
grid on;
xlabel('x');
ylabel('y');
title('Графики');

plot(X,Y1,'Color','r');
plot(X,Y2,'Color','g');
plot(X,Y3,'Color','b');
plot(X,Y4,'Color','y');

legend('Точки', 'ax+b', 'ax^2 + bx + c', 'ax^3 + bx^2 + cx + d', 'a*exp(x) + b*log(x) + c');
